{
  "advisories": [
    {
      "advisoryId": "cisco-sa-20191002-asa-dos",
      "advisoryTitle": "Cisco Adaptive Security Appliance Software and Firepower Threat Defense Software FTP Inspection Denial of Service Vulnerability",
      "bugIDs": [
        "CSCvo83169"
      ],
      "ipsSignatures": [
        "NA"
      ],
      "cves": [
        "CVE-2019-12673"
      ],
      "cvrfUrl": "https://tools.cisco.com/security/center/contentxml/CiscoSecurityAdvisory/cisco-sa-20191002-asa-dos/cvrf/cisco-sa-20191002-asa-dos_cvrf.xml",
      "cvssBaseScore": "8.6",
      "cwe": [
        "CWE-119"
      ],
      "firstPublished": "2019-10-02T16:00:00-0700",
      "lastUpdated": "2019-10-18T18:18:39-0700",
      "productNames": [
        "Cisco Adaptive Security Appliance (ASA) Software ",
        "Cisco Firepower Threat Defense Software "
      ],
      "publicationUrl": "https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20191002-asa-dos",
      "sir": "High",
      "summary": "<p>A vulnerability in the FTP inspection engine of Cisco&nbsp;Adaptive Security (ASA) Software and Cisco&nbsp;Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to cause a denial of service (DoS) condition on an affected device.</p>\n<p>The vulnerability is due to insufficient validation of FTP data. An attacker could exploit this vulnerability by sending malicious FTP traffic through an affected device. A successful exploit could allow the attacker to cause a DoS condition on the affected device.</p>\n<p>Cisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.</p>\n<p>This advisory is available at the following link:<br />\n<a href=\"https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20191002-asa-dos\">https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20191002-asa-dos</a></p>\nThis advisory is part of the October 2019 Cisco ASA, FMC, and FTD Software Security Advisory Bundled Publication, which includes 10 Cisco Security Advisories that describe 18 vulnerabilities. For a complete list of the advisories and links to them, see <a href=\"http://tools.cisco.com/security/center/viewErp.x?alertId=ERP-72541\">Cisco Event Response: October 2019 Cisco ASA, FMC, and FTD Software Security Advisory Bundled Publication</a>."
    }
  ]
}